In [44]:
import pandas as pd

In [45]:
csv_df = pd.read_csv('untitled.txt')

In [46]:
csv_df.head()

    hd1   hd2   hd3
0   NaN    19  20.0
1   3.0     5   NaN
2   6.0     7   8.0
3  10.0    11  12.0

In [47]:
csv_df.shape

(4, 3)

In [48]:
csv_df.columns

Index(['hd1', ' hd2', ' hd3'], dtype='object')

In [49]:
csv_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
hd1     3 non-null float64
 hd2    4 non-null int64
 hd3    3 non-null float64
dtypes: float64(2), int64(1)
memory usage: 224.0 bytes

In [50]:
csv_df.dropna()

    hd1   hd2   hd3
2   6.0     7   8.0
3  10.0    11  12.0

In [5]:
import pandas as pd

df = pd.read_csv("untitled.txt") 	
csv_f = df.dropna()
csv_f_dropped_Values = df[~df.index.isin(csv_f.index)]

In [6]:
csv_f_dropped_Values

   hd1   hd2   hd3
0  NaN    19  20.0
1  3.0     5   NaN